# n*n хэмжээтэй матриц өгөгдөв. 0 бол далай, 1 бол эх газар.
# талуудаараа зэрэгцсэн бол холбогдсон гэж үзнэ.
# Өөрөөр хэлбэл, хоёр 1 нүд диагоналаар зэрэгцсэн бол холбогдсон гэхгүй.
# Графын нийт арлын тоог ол.

def count_islands(grid):
    n = len(grid)
    count = 0
    
    def dfs(i, j):
        # хязгаараас гарах эсвэл ус таарвал зогсоно
        if i<0 or i>=n or j<0 or j>=n or grid[i][j] == 0:
            return
        
        # очсон эх газрыг(оройг) ус болгоно
        grid[i][j] = 0
        
        # dfs 4 чиглэл рүү рекурсивээр явна
        dfs(i+1, j)
        dfs(i-1, j)
        dfs(i, j+1)
        dfs(i, j-1)
    
    # эх газартай таарвал бүртгэж аваад dfs ажиллуулна
    for i in range(n):
        for j in range(n):
            if grid[i][j] == 1:
                count += 1
                dfs(i, j)
                
    return count

grid1 = [
    [1, 1, 0],
    [1, 0, 0],
    [0, 0, 1]
]

grid2 = [
    [1, 1, 0, 0, 1],
    [1, 0, 0, 1, 1],
    [0, 0, 1, 0, 0],
    [1, 0, 1, 1, 0],
    [1, 0, 0, 0, 1]
]

grid3 = [
    [1, 0, 0, 1, 1, 0, 0, 0, 1, 0],
    [1, 0, 0, 0, 1, 0, 1, 1, 1, 0],
    [0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 0, 0],
    [1, 0, 0, 0, 1, 0, 0, 1, 1, 0],
    [1, 1, 0, 0, 0, 0, 0, 0, 1, 0],
    [0, 0, 0, 1, 1, 0, 0, 0, 0, 0],
    [0, 1, 0, 0, 0, 1, 1, 0, 0, 1],
    [0, 1, 1, 0, 0, 0, 0, 1, 0, 0],
    [1, 0, 0, 1, 0, 0, 1, 0, 0, 1]
]

print(count_islands(grid1))
print(count_islands(grid2))
print(count_islands(grid3))
