Атом

Нэг төрлийн атом нэгж радиустай бөмбөлөг эзлэн оршдог. Түүний N ширхэг электрон нь бөмбөлөгийн гадаргуу болох бөмбөлөг дээр жигд тархаж байрлаж байдаг ба нэг хавтгайд байрладаг. Бид ийм атомыг 2 хэсэгт хуваах даалгавартай. Хуваахад дурын гурван электроныг дайрсан хавтгайгаар зүсэх бөгөөд энэ зүсэлтээр үүсэх хоёр хэсэгт босон атом 2 хэсэг болон хуваагдана. Тэгвэл эдгээр хоёр хэсэгт нь яг M ширхэг электрон байх тохиолдлын тоог олно уу?

Оролт:

Эхний мөрөнд тестийн тоо T

Дараагийн мөр бүрт N ба M тоо

Гаралт:

T мөр бүрт харгалзах хариу байна

Хязгаарлалт

1 ≤ T ≤ 10

3 ≤ N ≤ 10⁹

0 ≤ M ≤ 10⁹

Хугацаа: 1 сек Санах ой: 16MB

Жишээ:

Оролт

3 3 0 4 1 5 3

Гаралт

1 4 2

Тайлбар

Test 1: 3 электрон дайрсан нэг хавтгай байх ба энэ хуваалтаар эсрэг талд 0 электрон болно

Test 2: Аль ч гурван электроныг сонгож хуваалт хийхэд 0 болон 1 электрон агуулсан 2 хэсэгт хуваагдана

Test 3: Гурван электрон сонгоход 2 электрон үлдэнэ
